Catalogs/ШкалыЗначенийХарактеристикПерсонала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШкалыЗначенийХарактеристикПерсонала</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
	</Catalog>
</MetaDataObject>

Catalogs/ЗначенияХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЗначенияХарактеристик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ШкалыЗначенийХарактеристикПерсонала</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧисловоеЗначение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШкалыЗначенийХарактеристикПерсонала/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользуетсяЭкспертнаяОценка = ПолучитьФункциональнуюОпцию("ИспользоватьЭкспертнуюОценкуПерсонала");
	Элементы.Значения.Шапка = ИспользуетсяЭкспертнаяОценка;
	Элементы.ЗначенияЧисловоеЗначение.Видимость = ИспользуетсяЭкспертнаяОценка;
	Элементы.ЗначенияПодсказка.Видимость = ИспользуетсяЭкспертнаяОценка;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПриПолученииДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Значения.Количество() < 2 И Не ПараметрыЗаписи.Свойство("СПустымСпискомЗначений") Тогда
		Отказ = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ПередЗаписьюЗавершение", ЭтотОбъект, ПараметрыЗаписи);
		ТекстВопроса = НСтр("ru = 'Шкала имеет менее двух значений.
			|Продолжить?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗаписатьЗначенияХарактеристикПерсонала(ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначения

&НаКлиенте
Процедура ЗначенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Значения.ТекущиеДанные;
	ТекущиеДанные.ПометкаУдаления = Ложь;
	ТекущиеДанные.ИндексКартинки = ИндексКартинкиЭлемента();
	
	Если Копирование Тогда
		ТекущиеДанные.Ссылка = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.Значения.ТекущиеДанные;
	ТекущиеДанные.ПометкаУдаления = Не ТекущиеДанные.ПометкаУдаления;	
	ТекущиеДанные.ИндексКартинки = ?(ТекущиеДанные.ПометкаУдаления, ИндексКартинкиЭлементаПометкаУдаления(),
		ИндексКартинкиЭлемента());

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиЭлемента()
	Возврат 3;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексКартинкиЭлементаПометкаУдаления()
	Возврат 4;
КонецФункции

&НаКлиенте
Процедура ПередЗаписьюЗавершение(Ответ, ПараметрыЗаписи) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПараметрыЗаписи.Вставить("СПустымСпискомЗначений");
		Записать(ПараметрыЗаписи);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()

	ЗаполнитьЗначенияХарактеристик();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияХарактеристик()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияХарактеристикПерсонала.Ссылка,
		|	ЗначенияХарактеристикПерсонала.Наименование,
		|	ЗначенияХарактеристикПерсонала.РеквизитДопУпорядочивания,
		|	ЗначенияХарактеристикПерсонала.ПометкаУдаления,
		|	ВЫБОР
		|		КОГДА ЗначенияХарактеристикПерсонала.ПометкаУдаления
		|			ТОГДА &ИндексКартинкиЭлементаПометкаУдаления
		|		ИНАЧЕ &ИндексКартинкиЭлемента
		|	КОНЕЦ КАК ИндексКартинки,
		|	ЗначенияХарактеристикПерсонала.ЧисловоеЗначение,
		|	ЗначенияХарактеристикПерсонала.Подсказка
		|ИЗ
		|	Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристикПерсонала
		|ГДЕ
		|	ЗначенияХарактеристикПерсонала.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗначенияХарактеристикПерсонала.РеквизитДопУпорядочивания";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("ИндексКартинкиЭлемента", ИндексКартинкиЭлемента());
	Запрос.УстановитьПараметр("ИндексКартинкиЭлементаПометкаУдаления", ИндексКартинкиЭлементаПометкаУдаления());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Значения.Очистить();
	
	Пока Выборка.Следующий() Цикл
		СтрокаЗначения = Значения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗначения, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияХарактеристикПерсонала(ТекущийОбъект)

	ТаблицаЗначений = Значения.Выгрузить();
	ТаблицаЗначений.Колонки.Добавить("НомерСтроки",
		Метаданные.Справочники.ЗначенияХарактеристик.Реквизиты.РеквизитДопУпорядочивания.Тип);
	
	НомерСтроки = 0;
	
	Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		СтрокаТаблицыЗначений.НомерСтроки = НомерСтроки;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НовыеЗначения.Наименование,
		|	НовыеЗначения.Ссылка,
		|	НовыеЗначения.НомерСтроки,
		|	НовыеЗначения.ПометкаУдаления,
		|	НовыеЗначения.ЧисловоеЗначение,
		|	НовыеЗначения.Подсказка
		|ПОМЕСТИТЬ ВТНовыеЗначения
		|ИЗ
		|	&НовыеЗначения КАК НовыеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НовыеЗначения.Наименование,
		|	НовыеЗначения.НомерСтроки КАК НомерСтроки,
		|	НовыеЗначения.ПометкаУдаления,
		|	ЗначенияХарактеристик.Ссылка КАК Ссылка,
		|	НовыеЗначения.ЧисловоеЗначение,
		|	НовыеЗначения.Подсказка КАК Подсказка
		|ИЗ
		|	ВТНовыеЗначения КАК НовыеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияХарактеристик КАК ЗначенияХарактеристик
		|		ПО НовыеЗначения.Ссылка = ЗначенияХарактеристик.Ссылка
		|ГДЕ
		|	(НовыеЗначения.Наименование <> ЗначенияХарактеристик.Наименование
		|	ИЛИ НовыеЗначения.НомерСтроки <> ЗначенияХарактеристик.РеквизитДопУпорядочивания
		|	ИЛИ НовыеЗначения.ЧисловоеЗначение <> ЗначенияХарактеристик.ЧисловоеЗначение
		|	ИЛИ НовыеЗначения.Подсказка <> ЗначенияХарактеристик.Подсказка
		|	ИЛИ НовыеЗначения.ПометкаУдаления <> ЗначенияХарактеристик.ПометкаУдаления
		|	ИЛИ ЗначенияХарактеристик.Ссылка ЕСТЬ NULL)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("НовыеЗначения", ТаблицаЗначений);	
	Запрос.УстановитьПараметр("Владелец", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			ОбъектЗначенияХарактеристики = Справочники.ЗначенияХарактеристик.СоздатьЭлемент();
			ОбъектЗначенияХарактеристики.Владелец = ТекущийОбъект.Ссылка;
		Иначе
			ОбъектЗначенияХарактеристики = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;
		
		ОбъектЗначенияХарактеристики.Наименование = Выборка.Наименование;
		ОбъектЗначенияХарактеристики.РеквизитДопУпорядочивания = Выборка.НомерСтроки;
		ОбъектЗначенияХарактеристики.ПометкаУдаления = Выборка.ПометкаУдаления;
		ОбъектЗначенияХарактеристики.ЧисловоеЗначение = Выборка.ЧисловоеЗначение;
		ОбъектЗначенияХарактеристики.Подсказка = Выборка.Подсказка;
		ОбъектЗначенияХарактеристики.Записать();
		
		СтрокаЗначения = Значения[Выборка.НомерСтроки-1];
		СтрокаЗначения.Ссылка = ОбъектЗначенияХарактеристики.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
